<?php


namespace app\common\model\user;


class RndChinaName
{

    private $arrXing,$numbXing;

    private $arrMing,$numbMing;

    private $arrNet,$numbNet;

    // function rndChinaName()
    // {

    // }

    public function __construct()
    {
        $this->getXingList();
        $this->getMingList();
        $this->getNetname();
    }

    /*
    获取姓列表
    */
    private function getXingList()
    {
        $this->arrXing=array('赵','钱','孙','李','周','吴','郑','王','冯','陈','褚','卫','蒋','沈','韩','杨',

            '朱','秦','尤','许','何','吕','施','张','孔','曹','严','华','金','魏','陶','姜','戚','谢','邹','喻',

            '柏','水','窦','章','云','苏','潘','葛','奚','范','彭','郎','鲁','韦','昌','马','苗','凤','花','方',

            '任','袁','柳','鲍','史','唐','费','薛','雷','贺','倪','汤','滕','殷','罗','毕','郝','安','常','傅',

            '卞','齐','元','顾','孟','平','黄','穆','萧','尹','姚','邵','湛','汪','祁','毛','狄','米','伏','成',

            '戴','谈','宋','茅','庞','熊','纪','舒','屈','项','祝','董','梁','杜','阮','蓝','闵','季','贾','路',

            '娄','江','童','颜','郭','梅','盛','林','钟','徐','邱','骆','高','夏','蔡','田','樊','胡','凌','霍',

            '虞','万','支','柯','管','卢','莫','柯','房','裘','缪','解','应','宗','丁','宣','邓','单','杭','洪',

            '包','诸','左','石','崔','吉','龚','程','嵇','邢','裴','陆','荣','翁','荀','于','惠','甄','曲','封',

            '储','仲','伊','宁','仇','甘','武','符','刘','景','詹','龙','叶','幸','司','黎','溥','印','怀','蒲',

            '邰','从','索','赖','卓','屠','池','乔','胥','闻','莘','党','翟','谭','贡','劳','逄','姬','申','扶',

            '堵','冉','宰','雍','桑','寿','通','燕','浦','尚','农','温','别','庄','晏','柴','瞿','阎','连','习',

            '容','向','古','易','廖','庾','终','步','都','耿','满','弘','匡','国','文','寇','广','禄','阙','东',

            '欧','利','师','巩','聂','关','荆','司马','上官','欧阳','夏侯','诸葛','闻人','东方','赫连','皇甫',

            '尉迟','公羊','澹台','公冶','宗政','濮阳','淳于','单于','太叔','申屠','公孙','仲孙','轩辕','令狐',

            '徐离','宇文','长孙','慕容','司徒','司空','小猪','奥利给');

        $this->numbXing = count($this->arrXing)-1; //姓总数
    }

    /*

    获取名列表

    */

    private function getMingList()
    {

        $this->arrMing=array('伟','刚','勇','毅','俊','峰','强','军','平','保','东','文','辉','力','明','永',

            '健','世','广','志','义','兴','良','海','山','仁','波','宁','贵','福','生','龙','元','全','国','胜',

            '学','祥','才','发','武','新','利','清','飞','彬','富','顺','信','子','杰','涛','昌','成','康','星',

            '光','天','达','安','岩','中','茂','进','林','有','坚','和','彪','博','诚','先','敬','震','振','壮',

            '会','思','群','豪','心','邦','承','乐','绍','功','松','善','厚','庆','磊','民','友','裕','河','哲',

            '江','超','浩','亮','政','谦','亨','奇','固','之','轮','翰','朗','伯','宏','言','若','鸣','朋','斌',

            '梁','栋','维','启','克','伦','翔','旭','鹏','泽','晨','辰','士','以','建','家','致','树','炎','德',

            '行','时','泰','盛','雄','琛','钧','冠','策','腾','楠','榕','风','航','弘','秀','娟','英','华','慧',

            '巧','美','娜','静','淑','惠','珠','翠','雅','芝','玉','萍','红','娥','玲','芬','芳','燕','彩','春',

            '菊','兰','凤','洁','梅','琳','素','云','莲','真','环','雪','荣','爱','妹','霞','香','月','莺','媛',

            '艳','瑞','凡','佳','嘉','琼','勤','珍','贞','莉','桂','娣','叶','璧','璐','娅','琦','晶','妍','茜',

            '秋','珊','莎','锦','黛','青','倩','婷','姣','婉','娴','瑾','颖','露','瑶','怡','婵','雁','蓓','纨',

            '仪','荷','丹','蓉','眉','君','琴','蕊','薇','菁','梦','岚','苑','婕','馨','瑗','琰','韵','融','园',

            '艺','咏','卿','聪','澜','纯','毓','悦','昭','冰','爽','琬','茗','羽','希','欣','飘','育','滢','馥',

            '筠','柔','竹','霭','凝','晓','欢','霄','枫','芸','菲','寒','伊','亚','宜','可','姬','舒','影','荔',

            '枝','丽','阳','妮','宝','贝','初','程','梵','罡','恒','鸿','桦','骅','剑','娇','纪','宽','苛','灵',

            '玛','媚','琪','晴','容','睿','烁','堂','唯','威','韦','雯','苇','萱','阅','彦','宇','雨','洋','忠',

            '宗','曼','紫','逸','贤','蝶','菡','绿','蓝','儿','翠','烟','一鸣');

        $this->numbMing = count($this->arrMing)-1; //名总数

    }

    /*

    获取网名

    */
    private function getNetname(){
        $this->arrNet=array("ゞ 瓷娃娃","吻安","凹凸曼也有身材","萌哒丸子","软妹咿呀哟","妥神 ！","呆萌妞i","100酷","我是超拽无敌小屎壳郎i","野性の小男人","大源小凯啵啵啵i","萌系大白(●—●)","、貓罐頭","猫街后巷","乖乖〓潴","BB","迩幸福","尛「西米","月亮姐姐是萌汉子i","咕^嚕嚕^","木偶丿娃娃","比鹿八岁小七岁","卐迗苮寶寶卐","优雅的猪 丶","傲娇一个我","↗°油炸皮卡丘","菟菟kě ài","狍子君","萌萌**大奇葩！","朴氏白牙","花花姑娘","小馒头","仦__灬狐狸","不卖萌，纯笑容。","萌萌哒超人变身^_^","kimi会发光丫^","橙子*kiss","起司猫君","柠檬仔℃","橘子喵有小小目标","安娜苏许愿精灵°","暖心萌菇凉","傻傻的你~","二二的女生很有爱","果粒陳!","卖萌的小行家","[囧光蛋i]","萌蛋子","暮光青柠","屁颠屁颠-->","小妹是萌比","熊孩子","二二更健康~","LoveLoveLove「Exo」","娃娃哈丶","哇咔咔。","牙牙乐、’","淺淺ε酒窩o○","猫腻菇凉","我爱爽歪歪~","月牙笑眼","病娇的脸≧v≦","懦蒾団じ☆ve","小兵好萌可以吃吗","酸酸甜甜就是我","▽檰錵糖ˇ","西瓜西瓜ο乎叫χìà天","点点圈","老子叫甜甜","家住魔仙堡","ε祈祈猫儿з","元气小坏坏","岁酱吖の","站在冰箱上的小仙女O","甜软奶喘~","●草莓味甜甜圈●","白云味の棉花糖","依旧那么甜(>w<)","擺個鬼臉童鞋","酒酿樱桃子υ","原味小仙女","猪精女孩","软嘟嘟","喵脸君≧v≦","我在魔仙堡玩泥巴","全幼儿园最可爱","兔眼睛弯弯","软果儿","乱可爱一把+/","撒娇小小怪~","仙女不饿щ","可爱的亲一口","来一碗小仙女","吃不饱的大可爱~","温致如猫","麻麻说我是只喵~","猫耳酱","进口可爱","扑通扑通少女心","天女のキス","ドーナツ","持伞猫","猫扑风铃","卡牌的甜心少女","草莓ぇ宝","`梨涡酒","拿可爱换你","草莓味的老仙女er","甜野猫","娇软甜伤","喵呜不停","种花の小仙女","智商都来卖萌了","甜ぃぅおかく","我来自熊猫星","给你一口甜甜","迷你仙","可愛い蘿が","十秒萌定你","甜过不二家","吃可爱长大的小学妹","馋奶兔","巧了我就是萌","生来就可爱ヽ(ⅴ＜●)","给你一囗甜甜゛","可紊","送分小仙女□","萝らか妹","。_饼干妹妹","自闭症网瘾萝莉.ら","两盒软妹~`","六眼飞鱼酱①","牧云@^-^@","一言不合就卖萌","じ污霉味的小仙女","讲道理我最可爱▔＾▔*","喵咕嘟","媚态萌生ら","种花兔","每天都超可爱的","`媚态萌玍","請把小熊还给我","づ泥萌怪物","げ小王子萌音","老街兔づ ●─● )づ","不如潦草","飞天小仙女","萌萌的小确幸","﹎每天都超可爱の","喵叽","⌒吧唧一口え宝妞(>▽<)","(_贩卖可爱","脸只能装可爱`°","好吃的軟妹//▽//","话少又软萌的仙女","好吃の软妹","全网最萌打怪小能手","手捧软喵メ","可可莉丝λ≧o≦","凯蒂猫の蝴蝶结","ミ養猫的萌妹","萌阿萌の网名集","爱打盹的猫","ó米朵喵ッ","シ最宝贝的宝贝","四分萌气^*","′本宫略萌","恶作劇小公主(/▽＼)","软萌娇羞学妹君","ぐθ常悠哉大王","天花板上的猫","喵吉欧尼酱","[笑梨涡]","睡午觉的喵儿","混网萝莉…Σ(′ⅴ｀","帝级撒娇王","λ.皮卡丘不会跳舞","头号可爱らb(~▽~)d","脸猫爱吃鱼","兔牙战士","酒窝上的奶油","luli酱`○’ω’○)","长颈鹿的棒棒糖","肩头软猫","咪咕猫","＾o)ρ稳妥一个萌妹儿","塔塔猫","羞稚","元气土豆喵","脸红派つ","软妹快递","小可爱1号﹏","萌面鹿","喵呜的小耳朵~m","本仙女是草莓味哒","萌辣","揽一身可爱ｖ","诺贝尔可爱奖","谜兔","ミ蓝莓格格巫","饭团萌霸爻","想当龙的猫”＞ω＜","萌糯糯ing","撒娇惯犯","软喵酱メ","呆梨小仙女ゾ","保护┲我方小仙女","会掀被子的寿司·","少女蒸汽机","爱吃甜筒的猫ぅ","毕傹我才⒊岁呀","東方可爱δ","塔普味的小仙女","Δ扛刀萝莉ㄟ▔＾▔ㄟ","24Ｋ小公举","╰°放开那萌比o-","喵小柒ミ是只喵","О-小可爱的诗．","大脸猫花花～※","＊.偷吃美梦的厷举","~骄纵萝莉","睡不醒的爱丽絲","丷爱笑的智障猫o-ω-","海綿北鼻℅","～超渣体质尐女呆","软绒兎兒\"~*","萌男我是软妹呀ゥ","总萌大人~Q~","迷倒一片喵iΦ","¤鹿鹿的小奶包","原味哆啦","嘟嘟熊爱笑宝貝","麋鹿小仙囡～′▽｀","υ醋溜仙女肉","萌美仁","喵锅先森","吐彩虹症","栅栏下的折耳仙女","~=o萌度适中最好","魔法少女喵","小可爱的春天","温柔大总攻。","来自软萌系の仙女О--","不酷但很软","兔叽妹妹的胡萝卜","猫小九的蔷薇花の","污界萌仙女","ε仙女有对小翅膀з","长得乖ぃ该我歪","智障小仙女","っ(小可爱一米五)っ","奶哟小仙女","奶油味软萌φ￣0￣","玩网萌少女","可爱公主萌＊^:^","软三岁","Crazy萌杀","^#暴走的neko酱","↗°油炸皮卡丘","[.萌兔暖心糖.]","l吃味的猫′ⅴ｀","﹊┲﹊萝莉捕猎人","米幺 (喵)","甜心小果奶。+。","鸡腿小仙女┢┦","￠　　 恋er","┏迁雨夜┓","诱犯","べ繁星つ","木槿","颜君","遗 弃 、Ｍ","囍孤女@","恐惧，","殺手","浪骨","心冷。","丑到拖网速","予衬","森槿","庆幸","情裂","R豁子`~","小甜心","巨兔菲@","烂泥","不归徒","ミ烙印ゝ","憋屈","墟烟","~自嘲","初涼い","-空 潮﹌","情契","〆_小悲伤","影怯","浮歌","海未深","绿弧菌","何陋","心脏（２/1）","好兮","看海@","鲸落","南七夏","相许","森瑾猫","学奴","↘梦o.く呓↙","棱镜","奚落","小娘．1ntゝ","- 慌","促膝","心盗i","-颜久冰","玖初.","┇像梦┆","三年散","被动 い","我不安°","阴沉。","乞许","隐疾","夏安","つ﹏余溫゛","氿雾","嘲愚","樱 娆","爽妹","囚神","唠甜嗑","时常饿","唠甜嗑","半衾梦","子栖","允世","阪姬","極樂鬼","甜是你","春夜浅","满栀","思檀郎","惟欲睡","花辞树","星軌x","离鸿","書生途","舟遥客","暗中人","遮云壑","紅太極","枕花眠","云巢","盗琴音","赠佳期","佞臣","战皆罪","献世佛","三生路","忘羡","东风软","纵山崖","孤凫","思慕","贪了杯","风月客","探春","远山浅","杯别","送舟行","枫以","缘字诀","甜中书","鸠书","山有枢","ぇ气","狱中猫","玩世","南烟","弥枳","生生漫","行雁书","桃扇骨","野稚","赠意","山川志","秋桜","霊感","清旖","风铃鹿","忱杏","烟酉","西岸风","罪歌","椒妓","兔姬","酒几许","煮诗","摆渡翁","野途","橘淮北","逐風","几欢","世俗姬","平野宿","梓桑","一秋","咦哩","呆喜","猫景","恕己","鱼忧","文饰","予囚","佘樂","冬灼","辜予","早乙女","游魂喵","执傲","神择","煞尾","薄情册","猎心人","紹介に","薄情眉","別れ","野慌","辄乜","幕倦","怙棘","駦屿","走野","七凉","二奴","鱼是乎","隔川盼","睬姥","夙月","寰鸾","渊鱼","素歆","粉霞よ","雾月","十鸦","青尢","嘤咛","雾夕","逃夭","似蜜餹","樱甜","渡鹤影","山柰","山柰","胭話","撞了怀","淤浪","鱼芗","烟柳","小青鲤","扶尾猫","罪鹜","拼了命的开心","≮绥曳遗矢≯","风吹屁屁凉丶","杀猪_小分队","年少总有装逼梦","﹡爱自由","有种心酸叫无权访问、","我心拗i","- 荒芜国度 °","聚宝坑@","゛mm、绅绅绅绅、绅士","蹲在校长面前唱忐忑~","写首小调名字叫后悔","so young","醉人烟°","ぐθ常悠哉大王","不是淑女我怕谁","Adam&仙女","喜欢用核桃砸脑门！","中二柚","就要赖上你的温柔。","毁我世界灭你天堂i","哪有动情是意外","喜欢D.Oi","莪恠記憶裡等伱","妄想与你成家","岁月在讽刺我的天真","幸福の成若","仍可同生共死","溃不成军的难过","别撩脸子","绾长发","Love Song@","り岁月茹梭","潮流肆虐青春","㈠嬙辶隔","退隐的王@","゛如癡如醉","你再没有回来","說過","孤独先生","一只鹿妖","有种狼会披羊皮","诗的颈窝","ぐ慢爱ъιe说ιí别","~n1爱wo","无 佣","吧唧一口吃掉你","`θzι仓徨灬","少妇杀手.","餅干ノ亅丶ωц老奶奶`※","微笑，因为你哭了╮","淡然的微笑丶藏着伤","坠落シ凡间的゛天使゜","—旧爱刺伤了新欢°","场控男帝","x╰下个路口 换俄等伱°","荼蘼﹌p/p","他纒繞嗻俄黣根榊泾しovё","心里住着你。","丨Yoyo丨team丨","何必太执着不属于自己东西","你对我是暧昧，不是爱情。","崩溃 -","糖心草","ゞ关键我特么是：李先森","那些年，一起泡过的温泉°","放任喜欢","D+調+曲+","笑容背后的忧伤","戒 爱 ●","蜕变№⑨〇後","不氣ωeι尐女¤","弄不死你i","村霸","世事堪玩味","果实小姐-","别太用力爱","我们都变了变的好陌生","ミ米老鼠∮","、物らi人非‘","Lick：me","我是金牛座我骄傲i","↘撒娇是种艺术","干戈挽惆怅","未央。","心静自然凉没钱自然瘦","施妄者","旧巷里的少年郎","猫巷女神@","杀丶人丨族灬","不登下kiss","像陣風吹过","他最扎心@！","若注定有一点苦楚","如来神掌","Prosperous丶寂寞终结╰╯","执伞青衣袖","混世大魔王","太陽刺痛了雙眼");

        $this->numbNet = count($this->arrNet)-1; //名总数

    }


    private function getXing()
    {
        return $this->arrXing[mt_rand(0,$this->numbXing)];
    }

    private function getMing()
    {

        return $this->arrMing[mt_rand(0,$this->numbMing)];
    }

    private function getbNet()
    {
        return $this->arrNet[mt_rand(0,$this->numbNet)];
    }

    public function getName($type=0)
    {
        //$this->rndChinaName();
        $name = '' ;
        //随机那0,5
        $type_name=array($type,"5");
        $random_keys=array_rand($type_name,1);
        $type = $type_name[$random_keys];
        switch($type) {
            case 0:
                $name = $this->getXing().$this->getMing().$this->getMing();
                $this->getXing();
                break;

            case 1: //2字

                $name = $this->getXing().$this->getMing();

                break;

            case 2: //随机2、3个字

                $name = $this->getXing().$this->getMing();

                if(mt_rand (0,100)>50)$name .= $this->getMing();

                break;

            case 3: //只取姓

                $name = $this->getbNet();

                break;

            case 4: //只取名

                $name = $this->getbNet();
                break;

            case 5: //网名

                $name = $this->getbNet();

                break;


                // default: //默认情况 1姓+2名
                $name = $this->getXing().$this->getMing().$this->getMing();
                break;
        }

        return $name;

    }

}