<?php
/**
 *                       .::::.
 *                     .::::::::.
 *                    :::::::::::
 *                 ..:::::::::::'
 *              '::::::::::::'                                   Created by PhpStorm.
 *                .::::::::::                                    User: SakunoRyoma QQ3079714
 *           '::::::::::::::..                                   Time: 2020/8/10 19:12
 *                ..::::::::::::.                                女神保佑，代码无bug！！！
 *              ``::::::::::::::::                               Codes are far away from bugs with the goddess！！！
 *               ::::``:::::::::'        .:::.
 *              ::::'   ':::::'       .::::::::.
 *            .::::'      ::::     .:::::::'::::.
 *           .:::'       :::::  .:::::::::' ':::::.
 *          .::'        :::::.:::::::::'      ':::::.
 *         .::'         ::::::::::::::'         ``::::.
 *     ...:::           ::::::::::::'              ``::.
 *    ````':.          ':::::::::'                  ::::..
 *                       '.:::::'                    ':'````..
 *
 */
return [
    // 聚合短信国内
    'short_msg' => [
        '205401' => '错误的手机号码',
        '205402' => '错误的短信模板ID',
        '205403' => '网络错误,请重试',
        '205404' => '发送失败，具体原因请参考返回reason',
        '205405' => '号码异常/同一号码发送次数过于频繁',
        '205406' => '不被支持的模板',
        '205407' => '批量发送号码超限',
        '205408' => '批量发送库存次数不足',
        '205409' => '系统繁忙，请稍后重试',
        '10001'  => '错误的请求KEY',
        '10002'  => '该KEY无请求权限',
        '10003'  => 'KEY过期',
        '10004'  => '错误的OPENID',
        '10005'  => '应用未审核超时，请提交认证',
        '10007'  => '未知的请求源',
        '10008'  => '被禁止的IP',
        '10009'  => '被禁止的KEY',
        '10011'  => '当前IP请求超过限制',
        '10012'  => '请求超过次数限制',
        '10013'  => '测试KEY超过请求限制',
        '10014'  => '系统内部异常',
        '10020'  => '接口维护',
        '10021'  => '接口停用'
    ],

];
