<?php
/**
 *                       .::::.
 *                     .::::::::.
 *                    :::::::::::
 *                 ..:::::::::::'
 *              '::::::::::::'                                   Created by PhpStorm.
 *                .::::::::::                                    User: SakunoRyoma QQ3079714
 *           '::::::::::::::..                                   Time: 2020/8/5 11:04
 *                ..::::::::::::.                                女神保佑，代码无bug！！！
 *              ``::::::::::::::::                               Codes are far away from bugs with the goddess！！！
 *               ::::``:::::::::'        .:::.
 *              ::::'   ':::::'       .::::::::.
 *            .::::'      ::::     .:::::::'::::.
 *           .:::'       :::::  .:::::::::' ':::::.
 *          .::'        :::::.:::::::::'      ':::::.
 *         .::'         ::::::::::::::'         ``::::.
 *     ...:::           ::::::::::::'              ``::.
 *    ````':.          ':::::::::'                  ::::..
 *                       '.:::::'                    ':'````..
 *
 */

// 该文件主要是存放业务状态码相关的配置
return [

    "success_status" => 1,
    "error_status" => 0,

    "not_login" => -1,
    "user_is_register" => -2,
    "action_not_found" => -3,
    "controller_not_found" => -4,


    // mysql相关的状态配置
    "mysql" => [
        "table_normal"  => 1, // 正常
        "table_padding" => 2, // 下架
        "table_delete"  => 1, // 删除
        "table_not_delete" => 0, // 未删除
    ],

    "status" => [
        "error"   => 0,
        "success" => 1
    ],

    "code" => [

    ],

    "error" => [
        'is_error' => 1,
        'no_error' => 0
    ],


    'success_code'=>10000,
    'error_code'=>40004,

    /********************************jomlz start******************************************/
    //身份
    'IDENTITY' => [
        1 => '平台',
        2 => '供应商',
        3 => '门店',
        4 => '团长',
        5 => '仓库',
    ],

    //优惠类型
    'PROM_TYPE' => [
        0 => '普通',
        1 => '拼团',
        2 => '秒杀',
        3 => '预售',
        4 => '抢购',
    ],

    //运费模板类型
    'FREIGHT_TYPE' =>[
        1 => '计件',
        2 => '商品重量',
        3 => '商品体积',
    ],

    'PAY_TYPE' => [
        '1' => '微信',
        '2' => '支付宝',
        '3' => '余额',
        '4' => '积分兑换',
    ],

    'SHIPPING_TYPE' => [
        '1' => '快递发货',
        '2' => '上门自提',
        '3' => '同城配送',
    ],

    'ORDER_STATUS' => [
        '0' => '待确认',
        '1' => '已确认',
        '2' => '已收货',
        '3' => '已取消',
        '4' => '已完成',
    ],

    'SHIPPING_STATUS' =>[
      '0' => '未发货',
      '1' => '已发货',
      '2' => '部分发货',
    ],

    'PAY_STATUS' => [
        '0' => '未支付',
        '1' => '已支付',
        '2' => '交定金',
    ],

    'AFTERSALES_TYPE' =>[
        '1' => '仅退款',
        '2' => '退货退款',
        '3' => '换货',
    ],

    'AFTERSALES_STATUS' => [
        '-2' => '用户取消',
        '-1' => '不同意',
        '0' => '待审核',
        '1' => '审核通过',
        '2' => '买家已发货',
        '3' => '商家已发货',
        '4' => '换货完成',
        '5' => '退款完成',
    ],
    /**********************************end****************************************************/
];